/*
 * 3.2
 * Обчисліть результати наступних виразів та вивести на екран напис 
 * українською мовою "Результат дорівнює:":
 * 2 + 3;
 * 4.5 * 56;
 * 2 / 3.0; 
 * @author Дондов Станіслав
 */

public class Task_3_2 {
	public static void main(String[] args) {
		System.out.println("Результат дорівнює: " + (2 + 3));
		System.out.println("Результат дорівнює: " + (4.5 * 56));
		System.out.println("Результат дорівнює: " + (2 / 3.0));
	}
}


//---------------(Terminal)---------------
// <= javac Task_1_1.java
// <= java Task_1_1

// => Результат дорівнює: 5
// => Результат дорівнює: 252.0
// => Результат дорівнює: 0.6666666666666666

