/*
 * 3.6
 * Створіть клас під назвою Dog із перевантаженим методом bark(). Цей
 * метод слід перевантажити на основі різних примітивних типів даних
 * і надрукувати різні типи гавкання, виття тощо, залежно від того, яка
 * версія з перевантаженням викликається. Напишіть main(), який ви-
 * кликає всі різні версії.
 * @author Дондов Станіслав
 */

public class Task_3_6 {
	public static void main(String[] args) {
		Dog dog = new Dog("sobaka", "wurf");
		dog.bark(1);
		dog.bark(1.1);
		dog.bark('a');
	}
}


//---------------(Terminal)---------------
// <= javac Task_3_6.java
// <= java Task_3_6

// => гавкання
// => виття
// => тощо

